 #include<iostream>
using namespace std;

int main()
{
	//string str;		//创建对象
	//const char* pStr = str.c_str();

/*+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
# # string( size_type length, char ch);
# # 赋值length个ch
+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+*/
	string str1(5, 'a');
	cout << str1 << endl;
/*+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
# #  string( const char *str );
# #  将 str 赋值进 对象
+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+*/
	string str2("yyyuuuasdasd");
	cout << str2 << endl;
/*+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
# #  string( const char *str, size_type length );
# #  将str的前length个赋值进对象，自带'\0'
+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+*/
	string str3("abcdefg", 3);
	cout << str3.c_str() << endl;
/*+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
# #  string( string &str, size_type index, size_type length );
# #  将&str的下标为index标记为赋值起始点，赋值起点后（包括起点）
# #  length个字符，自带'\0'
+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+*/
	string str4(str2, 2, 4);
	cout << str4.c_str() << endl;
/*+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
# # 将对象str2中的字符赋值进str5，包括'\0'
+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+*/
	string str5(str2);
	cout << str5.c_str() << endl;



/*+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
# #输入输出重载
+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+*/
	string str6("ancdefg");
	cout << str6 << endl;

	string str7("abc");
	cout << str7 << endl;
	cin >> str7;
	cout << str7 << endl;




	system("PAUSE");
	return 0;
}